{
  "format": "layers-model",
  "generatedBy": "keras v2.15.0",
  "convertedBy": "TensorFlow.js Converter v4.17.0",
  "modelTopology": {
    "keras_version": "2.15.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "batch_input_shape": [null, 150528],
              "dtype": "float32",
              "units": 64,
              "activation": "relu"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 32,
              "activation": "relu"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "linear"
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {"name": "dense_1/kernel", "shape": [150528, 64], "dtype": "float32"},
        {"name": "dense_1/bias", "shape": [64], "dtype": "float32"},
        {"name": "dense_2/kernel", "shape": [64, 32], "dtype": "float32"},
        {"name": "dense_2/bias", "shape": [32], "dtype": "float32"},
        {"name": "dense_3/kernel", "shape": [32, 1], "dtype": "float32"},
        {"name": "dense_3/bias", "shape": [1], "dtype": "float32"}
      ]
    }
  ]
}